# Lets import the necessary libraries for the tutorial. You might face trouble importing geopy and geopandas. Search for resources to know how to install them in anaconda.

In [1]:
import pandas as pd
import geopandas as gpd
import geopy
from geopy.geocoders import Nominatim

# We'll now set the locator

In [2]:
locator = Nominatim(user_agent="myGeocoder")

# Reading the geocode file that we are going to reverse into addresses

In [3]:
data = pd.read_excel("lat_lon.xlsx")

# Let's see how it looks. It is a one column dataset containing comma separated latitude and longitude.

In [4]:
data.head()

                 Location
0  24.8425246, 89.3484334
1  21.4452963, 91.9711812
2  22.3661323, 91.8512926
3  23.8264315, 90.3680908
4  23.8100632, 90.3794905

In [5]:
len(data)

10

In [6]:
data["Location"].head()

0    24.8425246, 89.3484334
1    21.4452963, 91.9711812
2    22.3661323, 91.8512926
3    23.8264315, 90.3680908
4    23.8100632, 90.3794905
Name: Location, dtype: object

# As we know a location is a combination of latitude and longitude, we are going to split the location column into 2 columns, namely, latitude and longitude.

In [7]:
# new data frame with split value columns 
new = data["Location"].str.split(", ", n = 1, expand = True) 
new.head()

            0           1
0  24.8425246  89.3484334
1  21.4452963  91.9711812
2  22.3661323  91.8512926
3  23.8264315  90.3680908
4  23.8100632  90.3794905

# Short note: here n is the number of split. I want to split location column once based on ','. So I used n = 1.

# We will assign these two columns to the dataframe we have.

In [8]:
# making separate latitude column from new data frame 
data["lat"]= new[0] 
  
# making separate longitude column from new data frame 
data["lon"]= new[1]

# Let's see if everything is okay!

In [9]:
data.head()

                 Location         lat         lon
0  24.8425246, 89.3484334  24.8425246  89.3484334
1  21.4452963, 91.9711812  21.4452963  91.9711812
2  22.3661323, 91.8512926  22.3661323  91.8512926
3  23.8264315, 90.3680908  23.8264315  90.3680908
4  23.8100632, 90.3794905  23.8100632  90.3794905

# Now we are on the final move. I will use 3 empty list to catch the lat, lon and address in the for loop.

In [10]:
sl_no = []
latitude = []
longitude = []
address = []
for i in range(len(data)):
    lat = data["lat"][i]
    lon = data["lon"][i]
    location = locator.reverse("{}, {}".format(lat, lon))
    latitude.append(lat)
    longitude.append(lon)
    sl_no.append(i)
    address.append(location.address)
    print("Address {} is Ready...".format(i))
    
print("\n\n############### All Addresses are Ready! ###############")

Address 0 is Ready...
Address 1 is Ready...
Address 2 is Ready...
Address 3 is Ready...
Address 4 is Ready...
Address 5 is Ready...
Address 6 is Ready...
Address 7 is Ready...
Address 8 is Ready...
Address 9 is Ready...


############### All Addresses are Ready! ###############

# It will let us know when all the addresses are ready.

# Now we will take an empty dataframe and then assign the latitude, longitude and address to this dataframe.

In [11]:
df = pd.DataFrame()

In [12]:
df['lat'] = latitude 
df['lon'] = longitude
df['address'] = address

# Let's check if everything going fine or not...

In [13]:
df.head()

          lat         lon                                            address
0  24.8425246  89.3484334  কলেজ রোড, কামারগাড়ি, উপশহর, বগুড়া, বগুড়া জেল...
1  21.4452963  91.9711812  Cox's Bazar KG & Model High School, বিমানবন্দর...
2  22.3661323  91.8512926  চক বাজার, বায়েজীদ বোস্তামী, চট্টগ্রাম, চট্টগ্...
3  23.8264315  90.3680908  Mahdum telecom(মাহদুম টেলিকম), ৪০, Road 8, সেক...
4  23.8100632  90.3794905  সেনপাডা, সেকশন ১৩, ঢাকা, ঢাকা জেলা, ঢাকা বিভাগ...

# Looks like we have got what we were looking for! We have generated address from latitude and longitude. 
# Now we will save this as an excel file in our local storage.

In [14]:
df.to_excel("Geocode_Reversed.xlsx")

# Happy Reverse Geocoding..!!